use std::vec;

use crate::font_face_types::color_clock::ColorClock;

struct Temple;

impl ColorClock for Temple {
    const HOUR: &'static str = r"
              Θ
              |
         _,*/@@@\,_
       ∙«≡≡≡≡«..»≡≡»∙
          ╟╧╧╧││╧╢
        Θ«╟╤╤╤││╤╢»Θ
    ∙,____╟╧╧╧││╧╢
  _,*@@@@@╟╤╤╤││╤╢»Θ
Θ≈≈≡≡≡≡≡≡≡╟╧╧╧││╧╢
   ╟╪╪╪╪╪╡╟╤╤╤││╤╢»Θ
   ╟╪╪╪╪╪╡╟╧╧╧││╧╢
 Θ«╟╧╧╧╧╧╡╟╤╤╤││╤╢»Θ
   ╟╤╤╤╤╤╡╟╧╧╧││╧╢
   ╟╪╪╪╪╪╡╟╤╤╤││╤╢
   ╙┴┴┴┴┴┘╙┴┴┴┴┴┴╜
";
    const MINUTES: &'static str = r"
              Θ
              |
         _,*/@@@\,_
       ∙«≡≡≡≡«..»≡≡»∙
          ╟╧╧╧││╧╢
    ∙,____╟╤╤╤││╤╢»Θ
  _,*@@@@@╟╧╧╧││╧╢
Θ≈≈≡≡≡≡≡≡≡╟╤╤╤││╤╢»Θ
   ╟╪╪╪╪╪╡╟╧╧╧││╧╢
 Θ«╟╧╧╧╧╧╡╟╤╤╤││╤╢»Θ
   ╟╤╤╤╤╤╡╟╧╧╧││╧╢
 Θ«╟╧╧╧╧╧╡╟╤╤╤││╤╢»Θ
   ╟╤╤╤╤╤╡╟╧╧╧││╧╢
   ╟╪╪╪╪╪╡╟╤╤╤││╤╢
   ╙┴┴┴┴┴┘╙┴┴┴┴┴┴╜
";
    const SECONDS: &'static str = Self::MINUTES;

    const LED_COORDS: Vec<u32> = vec![];

    const QUOTE: Option<&'static str> = Some("Fall down seven times, stand up eight");

    fn draw_clockface(clock_format: &str) {
        return;
    }
}
